#### Environment : dev

#### Terraform Format and Style 🖌``

#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>



```


Success! The configuration is valid.



```



</details>



#### Terraform Plan 📖`success`



<details><summary>Show Plan</summary>



```


terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_vpc.my_vpc will be created
  + resource "aws_vpc" "my_vpc" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "dev-vpc"
          + "environment" = "dev"
          + "project"     = "aws-project"
        }
      + tags_all                             = {
          + "Name"        = "dev-vpc"
          + "environment" = "dev"
          + "project"     = "aws-project"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: dev.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "dev.tfplan"


```



</details>



*Pusher: @IndusVR, Action: `pull_request`, Workflow: `Terraform`*
**Environment:** Dev (dev)